Autodesk.Revit.DB.Line.CreateUnbound(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new instance of an unbound linear curve.
origin:
The origin of the unbound line.
direction:
The direction of the unbound line.
Returns:
The new unbound line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
direction has zero length.
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Vector and origin cannot form a proper unbound line.
Since:
2014

Autodesk.Revit.DB.Line.CreateBound(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
Creates a new instance of a bound linear curve.
endpoint1:
The first line endpoint.
endpoint2:
The second line endpoint.
Returns:
The new bound line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentsInconsistentException:
Curve length is too small for Revit's tolerance (as identified by Application.ShortCurveTolerance).
Since:
2014

Autodesk.Revit.DB.Line.Direction
Returns the direction of the line.

Autodesk.Revit.DB.Line.Origin
Returns the origin of the line.

Autodesk.Revit.DB.Line
A line in space.